<a href="https://colab.research.google.com/github/Akhila-16/Akhila/blob/master/DBMS_5015.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import random
import statistics
df = pd.read_excel("VsemEsectionList.xlsx")

In [2]:
se=list(df["IV Sem E Section Roll List"])
print(se)

['Sl. No.', 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, nan, nan, nan, nan]

In [3]:
* 1.	Store the data of students of your class as on the start date of the semester -  roll number of student, name of student, age of student
ages=[]
for l in range(0,len(se)):
    age=["19","20"]
    a=random.randrange(18,21)
    ages.append(a)
df["ages"]=ages
print(df)

   IV Sem E Section Roll List    Unnamed: 1              Unnamed: 2  ages
0                     Sl. No.   Roll Number            Student Name    20
1                           1  321910305001    PUDURU VAMSI KRISHNA    20
2                           2  321910305002         DHARANI SRINIJA    18
3                           3  321910305003     MUTTINENI AISHWARYA    18
4                           4  321910305004   NAGIREDDY JEEVANREDDY    18
..                        ...           ...                     ...   ...
60                         60  321910305061  SAVARAPU JASPER PRINCE    19
61                        NaN           NaN                     NaN    20
62                        NaN          Boys                     NaN    20
63                        NaN         Girls                     NaN    20
64                        NaN         Total                     NaN    18

[65 rows x 4 columns]

In [4]:
lgroup=[]
for j in range(0,len(se)):
    group=["cse","ece","civil"]
    groups=random.choice(group)
    lgroup.append(groups)
df["branch"]=lgroup
print(df)

   IV Sem E Section Roll List    Unnamed: 1  ... ages  branch
0                     Sl. No.   Roll Number  ...   20   civil
1                           1  321910305001  ...   20   civil
2                           2  321910305002  ...   18     cse
3                           3  321910305003  ...   18   civil
4                           4  321910305004  ...   18     ece
..                        ...           ...  ...  ...     ...
60                         60  321910305061  ...   19   civil
61                        NaN           NaN  ...   20     ece
62                        NaN          Boys  ...   20     cse
63                        NaN         Girls  ...   20     ece
64                        NaN         Total  ...   18   civil

[65 rows x 5 columns]

In [5]:
dates=[]
for k in range(0,len(se)):
    date=["22/07/2021","23/07/2021"]
    date1=random.choice(date)
    dates.append(date1)
df["dates"]=dates
print(df)

   IV Sem E Section Roll List    Unnamed: 1  ... branch       dates
0                     Sl. No.   Roll Number  ...  civil  23/07/2021
1                           1  321910305001  ...  civil  22/07/2021
2                           2  321910305002  ...    cse  23/07/2021
3                           3  321910305003  ...  civil  23/07/2021
4                           4  321910305004  ...    ece  23/07/2021
..                        ...           ...  ...    ...         ...
60                         60  321910305061  ...  civil  23/07/2021
61                        NaN           NaN  ...    ece  23/07/2021
62                        NaN          Boys  ...    cse  22/07/2021
63                        NaN         Girls  ...    ece  22/07/2021
64                        NaN         Total  ...  civil  22/07/2021

[65 rows x 6 columns]

In [6]:
* 2.	Add the students who joined later till date
list1=[]
for add in range(0,len(se)):
    if df["dates"][add]!="22/07/2021":
        list1.append(df["Unnamed: 2"][add])
print("The people to be added are",len(list1))
print("The people are",list1)

The people to be added are 41
The people are ['Student Name', 'DHARANI SRINIJA', 'MUTTINENI AISHWARYA', 'NAGIREDDY JEEVANREDDY', 'SANKEPALLI CHENNA SANDEEP REDDY', 'BYALLA CHANDRA SEKHER', 'SHAIK KHAJA KAIF AZAM', 'ANIMALA VENKATA SAI VIDYA', 'GUTTIKONDA NIKHITHA', 'BOMMA SREE LAKSHMI', 'DUGGINENI AKHILA CHOWDARY', 'THATHEKALVA OMPRAKASH REDDY', 'POTHURU SAI HEMANTH', 'ARUN KUMAR M', 'LAYA T', 'POORNIMA D S', 'KUDUMULA MULAMMAGARI VENKATESWARA REDDY', 'KURAPATI JAYA SAI KRISHNA', 'ARIEF B', 'KONETI GOPAL MAHITH VARMA', 'PEDDIREDDY SASI KUMAR', 'VALLIVEDU LOHITH', 'YELLICHERLA LOKESWAR REDDY', 'NAKHEEB SAMEER', 'BATHULA BHARATH KUMAR GOWD', 'KURABA DINESH', 'VANNELA PAVAN KALYAN', 'BUSALA CHARAN SRI TEJA', 'ANIL KUMAR B R', 'GOUTHAMI D', 'LOKA SURYA TEJESWARA REDDY', 'KAMMARI CHARITHA', 'SHRAVAN S', 'KOGILATHOTA AISWARYA', 'KARRI SATHVIKA', 'RAHUL K', 'K SAI GANESH', 'VARSHINI V', 'AKSHAY Y P', 'SAVARAPU JASPER PRINCE', nan]

In [7]:
*3.	Delete the students who shifted to other branches
list2=[]
for dele in range(0,len(se)):
    if df["branch"][dele]!="cse":
        list2.append(dele)
print(list2)
del list2

[0, 1, 3, 4, 5, 7, 9, 10, 11, 12, 14, 15, 16, 17, 18, 21, 25, 28, 29, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 43, 44, 46, 49, 50, 51, 52, 53, 55, 57, 59, 60, 61, 63, 64]

In [8]:
df

   IV Sem E Section Roll List    Unnamed: 1  ... branch       dates
0                     Sl. No.   Roll Number  ...  civil  23/07/2021
1                           1  321910305001  ...  civil  22/07/2021
2                           2  321910305002  ...    cse  23/07/2021
3                           3  321910305003  ...  civil  23/07/2021
4                           4  321910305004  ...    ece  23/07/2021
..                        ...           ...  ...    ...         ...
60                         60  321910305061  ...  civil  23/07/2021
61                        NaN           NaN  ...    ece  23/07/2021
62                        NaN          Boys  ...    cse  22/07/2021
63                        NaN         Girls  ...    ece  22/07/2021
64                        NaN         Total  ...  civil  22/07/2021

[65 rows x 6 columns]

In [9]:
*4.	Find who is the youngest in the Class
for y in range(1,len(se)):
    if df["ages"][y]==18:
        print("These are youngest students in the class",df["Unnamed: 2"][y])

These are youngest students in the class DHARANI SRINIJA
These are youngest students in the class MUTTINENI AISHWARYA
These are youngest students in the class NAGIREDDY JEEVANREDDY
These are youngest students in the class NAVNEETH N
These are youngest students in the class BYALLA CHANDRA SEKHER
These are youngest students in the class ANIMALA VENKATA SAI VIDYA
These are youngest students in the class GUTTIKONDA NIKHITHA
These are youngest students in the class RAJAVARI THANUJA
These are youngest students in the class THATHEKALVA OMPRAKASH REDDY
These are youngest students in the class POTHURU SAI HEMANTH
These are youngest students in the class C REVANTH REDDY
These are youngest students in the class ARIEF B
These are youngest students in the class PEDDIREDDY SASI KUMAR
These are youngest students in the class VALLIVEDU LOHITH
These are youngest students in the class DEVIREDDY REETHU SREE
These are youngest students in the class GANGIMENI POLAPPA
These are youngest students in the class BHUVAN A L
These are youngest students in the class LOKA SURYA TEJESWARA REDDY
These are youngest students in the class RAHUL K
These are youngest students in the class AKSHAY Y P
These are youngest students in the class nan

In [10]:
*5.	Find who is the eldest in the class
for e in range(0,len(se)):
    if df["ages"][e]==20:
        print("These are eldest students in the class",df["Unnamed: 2"][e])

These are eldest students in the class Student Name
These are eldest students in the class PUDURU VAMSI KRISHNA
These are eldest students in the class BOMMA SREE LAKSHMI
These are eldest students in the class JALADHI SAI VARSHINI
These are eldest students in the class RAMIREDDY MAHIDHAR REDDY
These are eldest students in the class POORNIMA D S
These are eldest students in the class KUDUMULA MULAMMAGARI VENKATESWARA REDDY
These are eldest students in the class KURAPATI JAYA SAI KRISHNA
These are eldest students in the class GODDUMARRI OBULA RAJA
These are eldest students in the class YELLICHERLA LOKESWAR REDDY
These are eldest students in the class NAKHEEB SAMEER
These are eldest students in the class KURABA DINESH
These are eldest students in the class CHEDELLA SUBRAMANYESWAR
These are eldest students in the class CHAKKA VENKATA DINESH
These are eldest students in the class MIDDI SREEDEVI
These are eldest students in the class RAKESH REDDY
These are eldest students in the class BUSALA CHARAN SRI TEJA
These are eldest students in the class RAMYA G
These are eldest students in the class KARRI SATHVIKA
These are eldest students in the class BHOOMIKA H K
These are eldest students in the class VARSHINI V
These are eldest students in the class nan
These are eldest students in the class nan
These are eldest students in the class nan

In [12]:
* 6.	Find the average age of the class
sum=0
for i in range(0,len(se)):
    sum=sum+int(df["ages"][i])
print("The average of the class is",sum//len(se))

The average of the class is 19

In [13]:
*7.	Find the median age of the class
for k in range(0,len(se)):
    median= statistics.median(df["ages"])
    print(median)
    break

19